Repository: cert-ee/s4a
Catalog: scripts/installer/locale/*/LC_MESSAGES/detector.po
Languages: et

source: Unknown OS
et: Tundmatu operatsioonisüsteem

# yes_or_no
source: Please answer yes or no.
et: Palun vasta jah (yes) või ei.(no)

# coward_quits
source: Oh, mighty stranger, I have to fail you, I'm only ready to deliver myself via Debian packages. Quitting cowardly.
et: Oo julge tundmatu, paraku pean loobumist tunnistma, olen valmis ennast paigaldama vaid Debiani pakkide kaudu. Lahkun saba jalge vahel.

# initial_requirements
source: On a fresh basic Ubuntu 16.04 system installation will take about 3G.
et: Värske tavalise Ubuntu 16.04 serveri installi puhul võtab installatsioon umbes 3G.

# wish_to_continue
source: Do you wish to continue?
et: Kas soovid jätkata?

# need_root
source: Salt requires root privileges to install. Please re-run this script as root.
et: Salt vajab installeerimiseks root privileege. Palun jooksuta scripti uuesti root õigustes

source: Install initiated
et: Installatsioon käivitatud

source: Installing prequisites
et: Installeerin eelduseid

# bootstrapping_salt
source: Bootstrap salt from
et: Installeerin Salti aadressilt

# send_to_cert
source: Send to CERT-EE?
et: Kas saadan CERT-EE'sse?

# salt_install_failed
source: Salt installation failed
et: Salti installatsioon ebaõnnestus

# configure_salt
source: Configure salt for git backend
et: Konfigureerin Salti gitiga koostööks

source: Configure ssh keys
et: Konfigureerin ssh võtmeid

# apply_state
source: Apply Detector state
et: Paigalda Detector

# system_is_installed
source: Base system is now installed, please point web browser to following location to continue installation
et: Baassüsteem on nüüd installeeritud, palun ava jätkamiseks veebilehitsejas järgmine aadress

source: Username
et: Kasutajanimi

source: Password
et: Salasõna

# state_failed
source: Detector state failed
et: Detectori pagaldus ebaõnnestus

# log_sent_to_cert
source: Log sent to CERT-EE
et: Logi saadetud CERT-EE

source: Received case nr
et: Vastu võetud juhtum nr.

# software_is_designed_to_run_on
source: Current software is designed and tested to run on
et: See tarkvara on disainitud ja testitud platvormil

# on_your_own_if_running
source: You are on your own running this on your
et: Oled omapäi. Käivitad seda süsteemis

# script_runs_from_url
source: This script runs shell script from this URL to provide SaltStack utilities
et: See skript käivitab shelliscript järgmiselt aadressilt, et paigaldada SaltStacki vahendid

# extra_packages_needed
source: Following extra packages are required and will be installed if missing
et: Järgmised lisapakid on nõutud ning installeeritakse puudumise korral

# salt_state_will_be_added
source: After system is prepared Detector installer Salt state is added from
et: Pärast süsteemi ettevalimistamist paigaldatakse Detectori Salt State serverist

# require_outbond_ssh
source: Please note that all this requires outbond ssh and http connections
et: Pane tähele, et installatsiooniks on vaja väljuvaid ssh ja http ühendusi

# average_execution_time
source: Script's average execution time is 5-10min depending on internet and hardware performance.
et: Paigaldamine võtab keskmiselt 5-10 minutit sõltuvalt interneti kiirusest ja riistvara jõudlusest

# host_unreachable
source: Destination host unreachable
et: Serveri pole kättesaadav

source: port
et: lüüs

# low_on_space
source: You are running somewhat low on space, check the requirements from documentation. (Only /srv is checked, in case of more advanced partitioning ignore this message)
et: /srv partitsioonil on ruumi vähevõitu, kontrolli dokumentatsioonist vajadusi (pane tähele, et keerulisema partitsioneeringu korral ei pruugi see probleem olla, kontrolliti ainult /srv'd).

# low_on_mem
source: There might be insufficient amount of RAM, you might want to reconsider, check the documentation
et: Süsteemi muutmälu on vähevõitu, kontrolli dokumentatsiooni.

# zx_spectrum_detected
source: You might want to add some multiprocessing power, check the documentation
et: Süsteemi jõudlus võib olla ebapiisav, kontrolli dokumentatsiooni.
